Revit 2024 API
ReferencePoint.GetCoordinatePlaneReferenceXY Method
A reference for the XY plane of the coordinate system.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public Reference GetCoordinatePlaneReferenceXY()
Visual Basic
Public Function GetCoordinatePlaneReferenceXY As Reference
Visual C++
public:
Reference^ GetCoordinatePlaneReferenceXY()
See Also
ReferencePoint Class
Autodesk.Revit.DB Namespace